def inverse_element(a, n):
    
    # Функція `gcdex()` приймає два аргументи: a і b - цілі числа. Вона повертає кортеж (d, x, y), де d - НСД a і b, x таке, що ax + by = d, і y таке, що dx + by = d.

    def gcdex(a, b):
        """
        Знаходить найбільший спільний дільник (НСД) a і b, а також коефіцієнти x і y такі, що ax + by = НСД(a, b).

        Args:
            a: Перше ціле число.
            b: Друге ціле число.

        Returns:
            Кортеж (d, x, y), де d - НСД a і b, x таке, що ax + by = d, і y таке, що dx + by = d.
        """

        x, y = 0, 1
        while b != 0:
            q, r = a // b, a % b
            x, y = y - q * x, x
            a, b = b, r
        return a, x, y

    # Вона викликає функцію `gcdex()`, щоб знайти НСД a і n.

    d, x, _ = gcdex(a, n)

    # Якщо НСД a і n дорівнює 1, то a має мультиплікативно обернений елемент по модулю n.

    if d != 1:
        return None

    # В цьому випадку функція `inverse_element()` повертає x % n, де x - друге число з кортежу, який повертається функцією `gcdex()`.

    return x % n


    #Тест
if __name__ == "__main__":
    a = 5
    n = 18
    x = inverse_element(a, n)
    print("Мультиплікативний обернений елемент a по модулю n:", x)
